tiborsimon/embedded-tdd-headers/pic/pic18/pic18f85k22_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F85K22_H_
#define _PIC18F85K22_H_

#define PMD3                          0
#define CCP4MD                        1
#define CCP5MD                        2
#define CCP6MD                        3
#define CCP7MD                        4
#define CCP8MD                        5
#define PMD2                          6
#define CMP1MD                        7
#define CMP2MD                        8
#define CMP3MD                        9
#define TMR5MD                        10
#define TMR6MD                        11
#define TMR8MD                        12
#define PMD1                          13
#define EMBMD                         14
#define TMR1MD                        15
#define TMR2MD                        16
#define TMR3MD                        17
#define TMR4MD                        18
#define RTCCMD                        19
#define CTMUMD                        20
#define PSPMD                         21
#define PMD0                          22
#define ADCMD                         23
#define SSP1MD                        24
#define SPI1MD                        25
#define SPI2MD                        26
#define SSP2MD                        27
#define UART1MD                       28
#define UART2MD                       29
#define CCP1MD                        30
#define CCP2MD                        31
#define CCP3MD                        32
#define PSTR3CON                      33
#define PSTR3CON_STRA                 34
#define STRA3                         35
#define STRB3                         36
#define PSTR3CON_STRB                 37
#define PSTR3CON_STRC                 38
#define STRC3                         39
#define STRD3                         40
#define PSTR3CON_STRD                 41
#define STRSYNC3                      42
#define PSTR3CON_STRSYNC              43
#define PSTR3CON_CMPL0                44
#define CMPL03                        45
#define PSTR3CON_CMPL                 46
#define CMPL13                        47
#define PSTR3CON_CMPL1                48
#define PSTR2CON                      49
#define PSTR2CON_STRA                 50
#define P2DC02                        51
#define STRA2                         52
#define P2DC0CON                      53
#define STRB2                         54
#define P2DC12                        55
#define PSTR2CON_STRB                 56
#define P2DC1CON                      57
#define STRC2                         58
#define PSTR2CON_STRC                 59
#define P2DC22                        60
#define P2DC2CON                      61
#define P2DC32                        62
#define STRD2                         63
#define PSTR2CON_STRD                 64
#define P2DC3CON                      65
#define P2DC4CON                      66
#define STRSYNC2                      67
#define PSTR2CON_STRSYNC              68
#define P2DC42                        69
#define P2DC6CON                      70
#define PSTR2CON_CMPL                 71
#define CMPL02                        72
#define P2DC62                        73
#define PSTR2CON_CMPL0                74
#define CMPL12                        75
#define PSTR2CON_CMPL1                76
#define TXREG2                        77
#define RCREG2                        78
#define SPBRG2                        79
#define SPBRGH2                       80
#define BAUDCON2                      81
#define ABDEN2                        82
#define BAUDCON2_ABDEN                83
#define WUE2                          84
#define BAUDCON2_WUE                  85
#define BRG162                        86
#define BAUDCON2_BRG16                87
#define SCKP2                         88
#define TXCKP2                        89
#define BAUDCON2_TXCKP                90
#define DTRXP2                        91
#define RXDTP2                        92
#define BAUDCON2_RXDTP                93
#define RCMT2                         94
#define RCIDL2                        95
#define BAUDCON2_RCIDL                96
#define BAUDCON2_ABDOVF               97
#define ABDOVF2                       98
#define TXSTA2                        99
#define TX9D2                         100
#define TXSTA2_TX9D                   101
#define TXD82                         102
#define TRMT2                         103
#define TXSTA2_TRMT                   104
#define BRGH2                         105
#define TXSTA2_BRGH                   106
#define SENDB2                        107
#define TXSTA2_SENDB                  108
#define TXSTA2_SYNC                   109
#define SYNC2                         110
#define TXEN2                         111
#define TXSTA2_TXEN                   112
#define TX8_92                        113
#define TX92                          114
#define TXSTA2_TX9                    115
#define TXSTA2_CSRC                   116
#define CSRC2                         117
#define RCSTA2                        118
#define RCD82                         119
#define RX9D2                         120
#define RCSTA2_RX9D                   121
#define OERR2                         122
#define RCSTA2_OERR                   123
#define FERR2                         124
#define RCSTA2_FERR                   125
#define ADDEN2                        126
#define RCSTA2_ADDEN                  127
#define RCSTA2_CREN                   128
#define CREN2                         129
#define SREN2                         130
#define RCSTA2_SREN                   131
#define RC92                          132
#define RC8_92                        133
#define RCSTA2_RX9                    134
#define RX92                          135
#define RCSTA2_SPEN                   136
#define SPEN2                         137
#define ANCON2                        138
#define PCFG16                        139
#define ANSEL16                       140
#define PCFG17                        141
#define ANSEL17                       142
#define PCFG18                        143
#define ANSEL18                       144
#define PCFG19                        145
#define ANSEL19                       146
#define ANSEL20                       147
#define PCFG20                        148
#define ANSEL21                       149
#define PCFG21                        150
#define ANSEL22                       151
#define PCFG22                        152
#define ANSEL23                       153
#define PCFG23                        154
#define ANCON1                        155
#define ANSEL8                        156
#define PCFG8                         157
#define ANSEL9                        158
#define PCFG9                         159
#define PCFG10                        160
#define ANSEL10                       161
#define ANSEL11                       162
#define PCFG11                        163
#define PCFG12                        164
#define ANSEL12                       165
#define PCFG13                        166
#define ANSEL13                       167
#define PCFG14                        168
#define ANSEL14                       169
#define PCFG15                        170
#define ANSEL15                       171
#define ANCON0                        172
#define ANSEL0                        173
#define PCFG0                         174
#define ANSEL1                        175
#define PCFG1                         176
#define ANSEL2                        177
#define PCFG2                         178
#define ANSEL3                        179
#define PCFG3                         180
#define ANSEL4                        181
#define PCFG4                         182
#define ANSEL5                        183
#define PCFG5                         184
#define ANSEL6                        185
#define PCFG6                         186
#define ANSEL7                        187
#define PCFG7                         188
#define MEMCON                        189
#define WM                            190
#define WM0                           191
#define WM1                           192
#define WAIT0                         193
#define WAIT                          194
#define WAIT1                         195
#define EBDIS                         196
#define ODCON3                        197
#define CTMUDS                        198
#define U1OD                          199
#define U2OD                          200
#define ODCON2                        201
#define CCP3OD                        202
#define CCP4OD                        203
#define CCP5OD                        204
#define CCP6OD                        205
#define CCP7OD                        206
#define CCP8OD                        207
#define ODCON1                        208
#define SPI2OD                        209
#define CCP1OD                        210
#define CCP2OD                        211
#define SPI1OD                        212
#define REFOCON                       213
#define RODIV0                        214
#define RODIV                         215
#define RODIV1                        216
#define RODIV2                        217
#define RODIV3                        218
#define ROSEL                         219
#define ROSSLP                        220
#define ROON                          221
#define CCPTMRS2                      222
#define C8TSEL0                       223
#define C8TSEL                        224
#define C8TSEL1                       225
#define CCPTMRS1                      226
#define C4TSEL                        227
#define C4TSEL0                       228
#define C4TSEL1                       229
#define C5TSEL0                       230
#define C6TSEL0                       231
#define C7TSEL                        232
#define C7TSEL0                       233
#define C7TSEL1                       234
#define CCPTMRS0                      235
#define C1TSEL0                       236
#define C1TSEL                        237
#define C1TSEL1                       238
#define C1TSEL2                       239
#define C2TSEL0                       240
#define C2TSEL                        241
#define C2TSEL1                       242
#define C2TSEL2                       243
#define C3TSEL0                       244
#define C3TSEL                        245
#define C3TSEL1                       246
#define CM3CON                        247
#define CM3CON_CCH                    248
#define CCH03                         249
#define CM3CON_CCH0                   250
#define CCH13                         251
#define CM3CON_CCH1                   252
#define CM3CON_CREF                   253
#define CREF3                         254
#define CM3CON_EVPOL                  255
#define EVPOL03                       256
#define CM3CON_EVPOL0                 257
#define CM3CON_EVPOL1                 258
#define EVPOL13                       259
#define CM3CON_CPOL                   260
#define CPOL3                         261
#define COE3                          262
#define CM3CON_COE                    263
#define CM3CON_CON                    264
#define CON3                          265
#define CM2CON                        266
#define CM2CON_CCH                    267
#define CM2CON_CCH0                   268
#define CCH02                         269
#define CCH12                         270
#define CM2CON_CCH1                   271
#define CM2CON_CREF                   272
#define CREF2                         273
#define CM2CON_EVPOL                  274
#define EVPOL02                       275
#define CM2CON_EVPOL0                 276
#define EVPOL12                       277
#define CM2CON_EVPOL1                 278
#define CM2CON_CPOL                   279
#define CPOL2                         280
#define CM2CON_COE                    281
#define COE2                          282
#define CM2CON_CON                    283
#define CON2                          284
#define T8CON                         285
#define T8CKPS0                       286
#define T8CKPS                        287
#define T8CKPS1                       288
#define TMR8ON                        289
#define T8OUTPS                       290
#define T8OUTPS0                      291
#define T8OUTPS1                      292
#define T8OUTPS2                      293
#define T8OUTPS3                      294
#define PR8                           295
#define TMR8                          296
#define T6CON                         297
#define T6CKPS0                       298
#define T6CKPS                        299
#define T6CKPS1                       300
#define TMR6ON                        301
#define T6OUTPS0                      302
#define T6OUTPS                       303
#define T6OUTPS1                      304
#define T6OUTPS2                      305
#define T6OUTPS3                      306
#define PR6                           307
#define TMR6                          308
#define CCP8CON                       309
#define CCP8M0                        310
#define CCP8M                         311
#define CCP8M1                        312
#define CCP8M2                        313
#define CCP8M3                        314
#define DC8B0                         315
#define CCP8Y                         316
#define DC8B                          317
#define DC8B1                         318
#define CCP8X                         319
#define CCPR8L                        320
#define CCPR8H                        321
#define CCP3CON                       322
#define CCP3M                         323
#define CCP3M0                        324
#define CCP3M1                        325
#define CCP3M2                        326
#define CCP3M3                        327
#define DC3B                          328
#define DC3B0                         329
#define DC3B1                         330
#define P3M                           331
#define P3M0                          332
#define P3M1                          333
#define CCPR3L                        334
#define CCPR3H                        335
#define ECCP3DEL                      336
#define P3DC                          337
#define P3DC0                         338
#define P3DC1                         339
#define P3DC2                         340
#define P3DC3                         341
#define P3DC4                         342
#define P3DC5                         343
#define P3DC6                         344
#define P3RSEN                        345
#define PSS3BD0                       346
#define PSS3BD                        347
#define PSS3BD1                       348
#define PSS3AC0                       349
#define PSS3AC                        350
#define PSS3AC1                       351
#define ECCP3AS                       352
#define ECCP3AS0                      353
#define ECCP3AS1                      354
#define ECCP3AS2                      355
#define ECCP3ASE                      356
#define CCP2CON                       357
#define CCP2M                         358
#define CCP2M0                        359
#define CCP2M1                        360
#define CCP2M2                        361
#define CCP2M3                        362
#define DC2B                          363
#define DC2B0                         364
#define CCP2Y                         365
#define DC2B1                         366
#define CCP2X                         367
#define P2M                           368
#define P2M0                          369
#define P2M1                          370
#define CCPR2L                        371
#define CCPR2H                        372
#define ECCP2DEL                      373
#define P2DC                          374
#define P2DC0                         375
#define P2DC1                         376
#define P2DC2                         377
#define P2DC3                         378
#define P2DC4                         379
#define P2DC5                         380
#define P2DC6                         381
#define P2RSEN                        382
#define PSS2BD                        383
#define PSS2BD0                       384
#define PSS2BD1                       385
#define PSS2AC0                       386
#define PSS2AC                        387
#define PSS2AC1                       388
#define ECCP2AS0                      389
#define ECCP2AS                       390
#define ECCP2AS1                      391
#define ECCP2AS2                      392
#define ECCP2ASE                      393
#define PADCFG1                       394
#define RTSECSEL0                     395
#define RTSECSEL                      396
#define RTSECSEL1                     397
#define PADCFG1_RJPU                  398
#define REPU                          399
#define RDPU                          400
#define CM1CON                        401
#define CM1CON_CCH                    402
#define C1CH0                         403
#define CM1CON_CCH0                   404
#define CCH01                         405
#define CCH11                         406
#define C1CH1                         407
#define CM1CON_CCH1                   408
#define CM1CON_CREF                   409
#define CREF1                         410
#define EVPOL01                       411
#define CM1CON_EVPOL0                 412
#define CM1CON_EVPOL                  413
#define CM1CON_EVPOL1                 414
#define EVPOL11                       415
#define CM1CON_CPOL                   416
#define CPOL1                         417
#define CM1CON_COE                    418
#define COE1                          419
#define CM1CON_CON                    420
#define CON1                          421
#define CTMUICON                      422
#define IRNG                          423
#define IRNG0                         424
#define IRNG1                         425
#define ITRIM0                        426
#define ITRIM                         427
#define ITRIM1                        428
#define ITRIM2                        429
#define ITRIM3                        430
#define ITRIM4                        431
#define ITRIM5                        432
#define CTMUCONL                      433
#define EDG1STAT                      434
#define EDG2STAT                      435
#define EDG1SEL                       436
#define EDG1SEL0                      437
#define EDG1SEL1                      438
#define EDG1POL                       439
#define EDG2SEL0                      440
#define EDG2SEL                       441
#define EDG2SEL1                      442
#define EDG2POL                       443
#define CTMUCONH                      444
#define CTTRIG                        445
#define IDISSEN                       446
#define EDGSEQEN                      447
#define EDGEN                         448
#define TGEN                          449
#define CTMUSIDL                      450
#define CTMUEN                        451
#define ALRMVALL                      452
#define ALRMVALH                      453
#define ALRMRPT                       454
#define ARPT0                         455
#define ARPT                          456
#define ARPT1                         457
#define ARPT2                         458
#define ARPT3                         459
#define ARPT4                         460
#define ARPT5                         461
#define ARPT6                         462
#define ARPT7                         463
#define ALRMCFG                       464
#define ALRMPTR                       465
#define ALRMPTR0                      466
#define ALRMPTR1                      467
#define AMASK0                        468
#define AMASK                         469
#define AMASK1                        470
#define AMASK2                        471
#define AMASK3                        472
#define CHIME                         473
#define ALRMEN                        474
#define RTCVALL                       475
#define WAITE0                        476
#define RTCVALH                       477
#define WAITE1                        478
#define WAITM0                        479
#define WAITM1                        480
#define WAITM2                        481
#define WAITM3                        482
#define WAITB0                        483
#define WAITB1                        484
#define RTCCAL                        485
#define CAL0                          486
#define CAL                           487
#define CAL1                          488
#define CAL2                          489
#define CAL3                          490
#define CAL4                          491
#define CAL5                          492
#define CAL6                          493
#define CAL7                          494
#define RTCCFG                        495
#define RTCPTR0                       496
#define RTCPTR                        497
#define RTCPTR1                       498
#define RTCOE                         499
#define HALFSEC                       500
#define RTCSYNC                       501
#define RTCWREN                       502
#define RTCEN                         503
#define PIE6                          504
#define CMP1IE                        505
#define CMP2IE                        506
#define CMP3IE                        507
#define EEIE                          508
#define EEDATA                        509
#define EEADR                         510
#define EEADRH                        511
#define OSCCON2                       512
#define MFIOSEL                       513
#define MFIOFS                        514
#define SOSCGO                        515
#define SOSCRUN                       516
#define BAUDCON1                      517
#define BAUDCON1_ABDEN                518
#define ABDEN1                        519
#define BAUDCON1_WUE                  520
#define WUE1                          521
