tiborsimon/embedded-tdd-headers/pic/pic18/pic18f85k22_tdd.h
#define W4E                           522
#define BRG161                        523
#define BAUDCON1_BRG16                524
#define CKTXP                         525
#define BAUDCON1_TXCKP                526
#define SCKP1                         527
#define TXCKP1                        528
#define SCKP                          529
#define DTRXP1                        530
#define RXDTP1                        531
#define DTRXP                         532
#define RXCKP                         533
#define BAUDCON1_RXDTP                534
#define RCMT1                         535
#define RCIDL1                        536
#define BAUDCON1_RCIDL                537
#define RCMT                          538
#define ABDOVF1                       539
#define BAUDCON1_ABDOVF               540
#define SSP2CON2                      541
#define SEN2                          542
#define SSP2CON2_SEN                  543
#define ADMSK12                       544
#define SSP2CON2_RSEN                 545
#define RSEN2                         546
#define SSP2CON2_ADMSK1               547
#define ADMSK22                       548
#define PEN2                          549
#define SSP2CON2_PEN                  550
#define SSP2CON2_ADMSK2               551
#define ADMSK32                       552
#define SSP2CON2_RCEN                 553
#define RCEN2                         554
#define SSP2CON2_ADMSK3               555
#define ACKEN2                        556
#define ADMSK42                       557
#define SSP2CON2_ADMSK4               558
#define SSP2CON2_ACKEN                559
#define ACKDT2                        560
#define ADMSK52                       561
#define SSP2CON2_ACKDT                562
#define SSP2CON2_ADMSK5               563
#define SSP2CON2_ACKSTAT              564
#define ACKSTAT2                      565
#define SSP2CON2_GCEN                 566
#define GCEN2                         567
#define SSP2CON1                      568
#define SSP2CON1_SSPM                 569
#define SSP2CON1_SSPM0                570
#define SSPM02                        571
#define SSPM12                        572
#define SSP2CON1_SSPM1                573
#define SSP2CON1_SSPM2                574
#define SSPM22                        575
#define SSPM32                        576
#define SSP2CON1_SSPM3                577
#define SSP2CON1_CKP                  578
#define CKP2                          579
#define SSPEN2                        580
#define SSP2CON1_SSPEN                581
#define SSPOV2                        582
#define SSP2CON1_SSPOV                583
#define WCOL2                         584
#define SSP2CON1_WCOL                 585
#define SSP2STAT                      586
#define SSP2STAT_BF                   587
#define BF2                           588
#define SSP2STAT_UA                   589
#define UA2                           590
#define SSP2STAT_R_W                  591
#define SSP2STAT_I2C_READ             592
#define RW2                           593
#define SSP2STAT_R                    594
#define SSP2STAT_nW                   595
#define READ_WRITE2                   596
#define nW2                           597
#define SSP2STAT_nWRITE               598
#define I2C_READ2                     599
#define SSP2STAT_R_NOT_W              600
#define R_nW2                         601
#define SSP2STAT_READ_WRITE           602
#define nWRITE2                       603
#define R_W2                          604
#define SSP2STAT_R_nW                 605
#define SSP2STAT_NOT_WRITE            606
#define SSP2STAT_S                    607
#define S2                            608
#define START2                        609
#define SSP2STAT_I2C_START            610
#define I2C_START2                    611
#define P2                            612
#define SSP2STAT_I2C_STOP             613
#define SSP2STAT_P                    614
#define STOP2                         615
#define I2C_STOP2                     616
#define I2C_DAT2                      617
#define SSP2STAT_D                    618
#define DATA_ADDRESS2                 619
#define SSP2STAT_D_NOT_A              620
#define SSP2STAT_I2C_DAT              621
#define D_A2                          622
#define SSP2STAT_NOT_ADDRESS          623
#define SSP2STAT_D_nA                 624
#define SSP2STAT_DATA_ADDRESS         625
#define SSP2STAT_nADDRESS             626
#define nA2                           627
#define DA2                           628
#define nADDRESS2                     629
#define D_nA2                         630
#define SSP2STAT_nA                   631
#define SSP2STAT_D_A                  632
#define SSP2STAT_CKE                  633
#define CKE2                          634
#define SSP2STAT_SMP                  635
#define SMP2                          636
#define MSK02                         637
#define SSP2ADD                       638
#define MSK12                         639
#define MSK22                         640
#define MSK32                         641
#define MSK42                         642
#define MSK52                         643
#define MSK62                         644
#define MSK72                         645
#define SSP2MSK                       646
#define SSP2MSK_MSK0                  647
#define SSP2MSK_MSK1                  648
#define SSP2MSK_MSK2                  649
#define SSP2MSK_MSK3                  650
#define SSP2MSK_MSK4                  651
#define SSP2MSK_MSK5                  652
#define SSP2MSK_MSK6                  653
#define SSP2MSK_MSK7                  654
#define SSP2BUF                       655
#define T4CON                         656
#define T4CKPS0                       657
#define T4CKPS                        658
#define T4CKPS1                       659
#define TMR4ON                        660
#define T4OUTPS                       661
#define T4OUTPS0                      662
#define T4OUTPS1                      663
#define T4OUTPS2                      664
#define T4OUTPS3                      665
#define PR4                           666
#define TMR4                          667
#define CCP7CON                       668
#define CCP7M0                        669
#define CCP7M                         670
#define CCP7M1                        671
#define CCP7M2                        672
#define CCP7M3                        673
#define DC7B                          674
#define CCP7Y                         675
#define DC7B0                         676
#define CCP7X                         677
#define DC7B1                         678
#define CCPR7L                        679
#define CCPR7H                        680
#define CCP6CON                       681
#define CCP6M                         682
#define CCP6M0                        683
#define CCP6M1                        684
#define CCP6M2                        685
#define CCP6M3                        686
#define CCP6Y                         687
#define DC6B0                         688
#define DC6B                          689
#define DC6B1                         690
#define CCP6X                         691
#define CCPR6L                        692
#define CCPR6H                        693
#define CCP5CON                       694
#define CCP5M0                        695
#define CCP5M                         696
#define CCP5M1                        697
#define CCP5M2                        698
#define CCP5M3                        699
#define CCP5Y                         700
#define DC5B0                         701
#define DC5B                          702
#define CCP5X                         703
#define DC5B1                         704
#define CCPR5L                        705
#define CCPR5H                        706
#define CCP4CON                       707
#define CCP4M                         708
#define CCP4M0                        709
#define CCP4M1                        710
#define CCP4M2                        711
#define CCP4M3                        712
#define CCP4Y                         713
#define DC4B0                         714
#define DC4B                          715
#define CCP4X                         716
#define DC4B1                         717
#define CCPR4L                        718
#define CCPR4H                        719
#define T5GCON                        720
#define T5GSS                         721
#define T5GSS0                        722
#define T5GSS1                        723
#define T5GVAL                        724
#define T5GGO_NOT_T5DONE              725
#define nT5DONE                       726
#define T5GGO_nT5DONE                 727
#define NOT_T5DONE                    728
#define T5GGO                         729
#define T5GSPM                        730
#define T5GTM                         731
#define T5GPOL                        732
#define TMR5GE                        733
#define T5CON                         734
#define TMR5ON                        735
#define T5CON_RD16                    736
#define RD165                         737
#define nT5SYNC                       738
#define NOT_T5SYNC                    739
#define SOSCEN5                       740
#define T5CON_SOSCEN                  741
#define T5CKPS                        742
#define T5CKPS0                       743
#define T5CKPS1                       744
#define TMR5CS0                       745
#define TMR5CS                        746
#define TMR5CS1                       747
#define TMR5L                         748
#define TMR5H                         749
#define EECON2                        750
#define EECON1                        751
#define RD                            752
#define WR                            753
#define WREN                          754
#define WRERR                         755
#define FREE                          756
#define CFGS                          757
#define EEFS                          758
#define EEPGD                         759
#define PORTA                         760
#define AN0                           761
#define ULPWUIN                       762
#define ULPWU                         763
#define RA0                           764
#define AN1                           765
#define RA1                           766
#define AN2                           767
#define RA2                           768
#define VREF_MINUS                    769
#define AN3                           770
#define VREF_PLUS                     771
#define RA3                           772
#define T0CKI                         773
#define RA4                           774
#define AN4                           775
#define T1CKI                         776
#define LVDIN                         777
#define RA5                           778
#define T3G                           779
#define HLVDIN                        780
#define CLKO                          781
#define RA6                           782
#define OSC2                          783
#define CLKI                          784
#define PORTA_RJPU                    785
#define RA7                           786
#define OSC1                          787
#define PORTB                         788
#define FLT0                          789
#define RB0                           790
#define INT0                          791
#define RB1                           792
#define INT1                          793
#define RB2                           794
#define INT2                          795
#define CTED1                         796
#define RB3                           797
#define CCP2_P2A                      798
#define INT3                          799
#define CCP2_PA2                      800
#define CTED2                         801
#define RB4                           802
#define KBI0                          803
#define PGM                           804
#define T3CKI                         805
#define RB5                           806
#define KBI1                          807
#define T1G                           808
#define PGC                           809
#define RB6                           810
#define KBI2                          811
#define PGD                           812
#define RB7                           813
#define KBI3                          814
#define PORTC                         815
#define SOSCO                         816
#define SCKLI                         817
#define RC0                           818
#define PORTC_CCP2                    819
#define PA2                           820
#define RC1                           821
#define SOSCI                         822
#define PORTC_P2A                     823
#define CCP1                          824
#define P1A                           825
#define PA1                           826
#define RC2                           827
#define SCK1                          828
#define SCL1                          829
#define RC3                           830
#define SDI1                          831
#define SDA1                          832
#define RC4                           833
#define SDO1                          834
#define RC5                           835
#define TX1                           836
#define RC6                           837
#define CK1                           838
#define RX1                           839
#define RC7                           840
#define DT1                           841
#define PORTD                         842
#define PSP0                          843
#define RD0                           844
#define CTPLS                         845
#define AD0                           846
#define PSP1                          847
#define RD1                           848
#define T5CKI                         849
#define T7G                           850
#define AD1                           851
#define PSP2                          852
#define RD2                           853
#define AD2                           854
#define PSP3                          855
#define RD3                           856
#define AD3                           857
#define PSP4                          858
#define RD4                           859
#define AD4                           860
#define SDO2                          861
#define PSP5                          862
#define RD5                           863
#define SDI2                          864
#define AD5                           865
#define SDA2                          866
#define SCK2                          867
#define PSP6                          868
#define RD6                           869
#define AD6                           870
#define SCL2                          871
#define SS2                           872
#define PSP7                          873
#define RD7                           874
#define NOT_SS2                       875
#define nSS2                          876
#define AD7                           877
#define PORTE                         878
#define P2D                           879
#define NOT_RD                        880
#define nRD                           881
#define PD2                           882
#define AD8                           883
#define RDE                           884
#define RE0                           885
#define P2C                           886
#define NOT_WR                        887
#define AD9                           888
#define nWR                           889
#define WRE                           890
#define RE1                           891
#define PC2                           892
#define P2B                           893
#define nCS                           894
#define NOT_CS                        895
#define CS                            896
#define CCP10                         897
#define PB2                           898
#define AD10                          899
#define RE2                           900
#define PORTE_CCP9                    901
#define CCP9E                         902
#define P3C                           903
#define REFO                          904
#define AD11                          905
#define RE3                           906
#define PC3E                          907
#define PORTE_CCP8                    908
#define PB3E                          909
#define P3B                           910
#define AD12                          911
#define RE4                           912
#define CCP8E                         913
#define PORTE_CCP7                    914
#define P1C                           915
#define CCP7E                         916
#define AD13                          917
#define RE5                           918
#define PC1E                          919
#define PORTE_CCP6                    920
#define CCP6E                         921
#define P1B                           922
#define AD14                          923
#define RE6                           924
#define PB1E                          925
#define CCP2E                         926
#define PORTE_P2A                     927
#define PA2E                          928
#define PORTE_CCP2                    929
#define AD15                          930
#define RE7                           931
#define PORTF                         932
#define C2OUTF                        933
#define AN6                           934
#define PORTF_C2OUT                   935
#define RF1                           936
#define CTDIN                         937
#define PORTF_C1OUT                   938
#define AN7                           939
#define RF2                           940
#define C1OUTF                        941
#define AN8                           942
#define RF3                           943
#define CTMUI                         944
#define C2INB                         945
#define AN9                           946
#define RF4                           947
#define C2INA                         948
#define C1INB                         949
#define RF5                           950
#define CVREF                         951
#define AN10                          952
#define C1INA                         953
#define RF6                           954
#define AN11                          955
#define SS1                           956
#define AN5                           957
#define RF7                           958
#define PORTG                         959
#define CCP3                          960
#define PA3                           961
#define RG0                           962
#define C3OUTG                        963
#define PORTG_C3OUT                   964
#define TX2                           965
#define RG1                           966
#define CK2                           967
#define AN19                          968
#define C3INA                         969
#define RX2                           970
#define RG2                           971
#define DT2                           972
#define AN18                          973
#define CCP4                          974
#define PD3                           975
#define C3INB                         976
#define RG3                           977
#define AN17                          978
#define CCP5                          979
#define PD1                           980
#define C3INC                         981
#define T7CKI                         982
#define T5G                           983
#define RG4                           984
#define RTCC                          985
#define AN16                          986
#define PORTG_RJPU                    987
#define RG5                           988
#define PORTH                         989
#define RH0                           990
#define A16                           991
#define AN23                          992
#define RH1                           993
#define A17                           994
#define AN22                          995
#define RH2                           996
#define A18                           997
#define AN21                          998
#define RH3                           999
#define A19                           1000
#define AN20                          1001
#define PORTH_CCP9                    1002
#define RH4                           1003
#define C2INC                         1004
#define PC3                           1005
#define AN12                          1006
#define PORTH_CCP8                    1007
#define RH5                           1008
#define PB3                           1009
#define C2IND                         1010
#define AN13                          1011
#define C1INC                         1012
#define RH6                           1013
#define PORTH_CCP7                    1014
#define PC1                           1015
#define AN14                          1016
#define RH7                           1017
#define PORTH_CCP6                    1018
#define PB1                           1019
#define AN15                          1020
#define PORTJ                         1021
#define RJ0                           1022
#define ALE                           1023
#define RJ1                           1024
#define OE                            1025
#define RJ2                           1026
#define WRL                           1027
#define RJ3                           1028
#define WRH                           1029
#define RJ4                           1030
#define BA0                           1031
#define RJ5                           1032
#define CE                            1033
#define RJ6                           1034
#define LB                            1035
#define RJ7                           1036
#define UB                            1037
#define LATA                          1038
#define LATA0                         1039
#define LA0                           1040
#define LATA1                         1041
#define LA1                           1042
#define LATA2                         1043
#define LA2                           1044
#define LATA3                         1045
#define LA3                           1046
#define LATA4                         1047
#define LA4                           1048
#define LATA5                         1049
#define LA5                           1050
#define LATA6                         1051
#define LA6                           1052
#define LATA7                         1053
#define LA7                           1054
#define LATB                          1055
#define LB0                           1056
#define LATB0                         1057
#define LB1                           1058
#define LATB1                         1059
#define LB2                           1060
#define LATB2                         1061
#define LB3                           1062
#define LATB3                         1063
#define LB4                           1064
#define LATB4                         1065
#define LB5                           1066
#define LATB5                         1067
#define LB6                           1068
#define LATB6                         1069
#define LB7                           1070
#define LATB7                         1071
#define LATC                          1072
#define LATC0                         1073
#define LC0                           1074
#define LATC1                         1075
#define LC1                           1076
#define LATC2                         1077
#define LC2                           1078
#define LATC3                         1079
#define LC3                           1080
#define LATC4                         1081
#define LC4                           1082
#define LATC5                         1083
#define LC5                           1084
#define LATC6                         1085
#define LC6                           1086
#define LATC7                         1087
#define LC7                           1088
#define LATD                          1089
#define LATD0                         1090
