tiborsimon/embedded-tdd-headers/pic/pic18/pic18f85k22_tdd.h
#define LD0                           1091
#define LATD1                         1092
#define LD1                           1093
#define LATD2                         1094
#define LD2                           1095
#define LATD3                         1096
#define LD3                           1097
#define LATD4                         1098
#define LD4                           1099
#define LATD5                         1100
#define LD5                           1101
#define LATD6                         1102
#define LD6                           1103
#define LATD7                         1104
#define LD7                           1105
#define LATE                          1106
#define LATE0                         1107
#define LE0                           1108
#define LATE1                         1109
#define LE1                           1110
#define LATE2                         1111
#define LE2                           1112
#define LATE3                         1113
#define LE3                           1114
#define LATE4                         1115
#define LE4                           1116
#define LATE5                         1117
#define LE5                           1118
#define LATE6                         1119
#define LE6                           1120
#define LATE7                         1121
#define LE7                           1122
#define LATF                          1123
#define LATF1                         1124
#define LF1                           1125
#define LF2                           1126
#define LATF2                         1127
#define LF3                           1128
#define LATF3                         1129
#define LF4                           1130
#define LATF4                         1131
#define LF5                           1132
#define LATF5                         1133
#define LF6                           1134
#define LATF6                         1135
#define LF7                           1136
#define LATF7                         1137
#define LATG                          1138
#define LATG0                         1139
#define LG0                           1140
#define LATG1                         1141
#define LG1                           1142
#define LATG2                         1143
#define LG2                           1144
#define LATG3                         1145
#define LG3                           1146
#define LATG4                         1147
#define LG4                           1148
#define LATH                          1149
#define LH0                           1150
#define LATH0                         1151
#define LH1                           1152
#define LATH1                         1153
#define LH2                           1154
#define LATH2                         1155
#define LH3                           1156
#define LATH3                         1157
#define LH4                           1158
#define LATH4                         1159
#define LH5                           1160
#define LATH5                         1161
#define LH6                           1162
#define LATH6                         1163
#define LH7                           1164
#define LATH7                         1165
#define LATJ                          1166
#define LATJ0                         1167
#define LJ0                           1168
#define LATJ1                         1169
#define LJ1                           1170
#define LATJ2                         1171
#define LJ2                           1172
#define LATJ3                         1173
#define LJ3                           1174
#define LATJ4                         1175
#define LJ4                           1176
#define LATJ5                         1177
#define LJ5                           1178
#define LATJ6                         1179
#define LJ6                           1180
#define LATJ7                         1181
#define LJ7                           1182
#define TRISA                         1183
#define TRISA0                        1184
#define TRISA1                        1185
#define TRISA2                        1186
#define TRISA3                        1187
#define TRISA4                        1188
#define TRISA5                        1189
#define TRISA6                        1190
#define TRISA7                        1191
#define TRISB                         1192
#define TRISB0                        1193
#define TRISB1                        1194
#define TRISB2                        1195
#define TRISB3                        1196
#define TRISB4                        1197
#define TRISB5                        1198
#define TRISB6                        1199
#define TRISB7                        1200
#define TRISC                         1201
#define TRISC0                        1202
#define TRISC1                        1203
#define TRISC2                        1204
#define TRISC3                        1205
#define TRISC4                        1206
#define TRISC5                        1207
#define TRISC6                        1208
#define TRISC7                        1209
#define TRISD                         1210
#define TRISD0                        1211
#define TRISD1                        1212
#define TRISD2                        1213
#define TRISD3                        1214
#define TRISD4                        1215
#define TRISD5                        1216
#define TRISD6                        1217
#define TRISD7                        1218
#define TRISE                         1219
#define TRISE0                        1220
#define TRISE1                        1221
#define TRISE2                        1222
#define TRISE3                        1223
#define TRISE4                        1224
#define TRISE5                        1225
#define TRISE6                        1226
#define TRISE7                        1227
#define TRISF                         1228
#define TRISF1                        1229
#define TRISF2                        1230
#define TRISF3                        1231
#define TRISF4                        1232
#define TRISF5                        1233
#define TRISF6                        1234
#define TRISF7                        1235
#define TRISG                         1236
#define TRISG0                        1237
#define TRISG1                        1238
#define TRISG2                        1239
#define TRISG3                        1240
#define TRISG4                        1241
#define TRISH                         1242
#define TRISH0                        1243
#define TRISH1                        1244
#define TRISH2                        1245
#define TRISH3                        1246
#define TRISH4                        1247
#define TRISH5                        1248
#define TRISH6                        1249
#define TRISH7                        1250
#define TRISJ                         1251
#define TRISJ0                        1252
#define TRISJ1                        1253
#define TRISJ2                        1254
#define TRISJ3                        1255
#define TRISJ4                        1256
#define TRISJ5                        1257
#define TRISJ6                        1258
#define TRISJ7                        1259
#define OSCTUNE                       1260
#define TUN0                          1261
#define TUN                           1262
#define TUN1                          1263
#define TUN2                          1264
#define TUN3                          1265
#define TUN4                          1266
#define TUN5                          1267
#define PLLEN                         1268
#define INTSRC                        1269
#define PSTR1CON                      1270
#define PSTR1CON_STRA                 1271
#define PSTR1CON_STRB                 1272
#define PSTR1CON_STRC                 1273
#define PSTR1CON_STRD                 1274
#define PSTR1CON_STRSYNC              1275
#define PSTR1CON_CMPL0                1276
#define PSTR1CON_CMPL                 1277
#define PSTR1CON_CMPL1                1278
#define PIE1                          1279
#define TMR1IE                        1280
#define TMR2IE                        1281
#define TMR1GIE                       1282
#define SSP1IE                        1283
#define SSPIE                         1284
#define TXIE                          1285
#define TX1IE                         1286
#define RCIE                          1287
#define RC1IE                         1288
#define ADIE                          1289
#define PSPIE                         1290
#define PIR1                          1291
#define TMR1IF                        1292
#define TMR2IF                        1293
#define TMR1GIF                       1294
#define SSPIF                         1295
#define SSP1IF                        1296
#define TXIF                          1297
#define TX1IF                         1298
#define RCIF                          1299
#define RC1IF                         1300
#define ADIF                          1301
#define PSPIF                         1302
#define IPR1                          1303
#define TMR1IP                        1304
#define TMR2IP                        1305
#define TMR1GIP                       1306
#define SSPIP                         1307
#define SSP1IP                        1308
#define TX1IP                         1309
#define TXIP                          1310
#define RCIP                          1311
#define RC1IP                         1312
#define ADIP                          1313
#define PSPIP                         1314
#define PIE2                          1315
#define TMR3GIE                       1316
#define TMR3IE                        1317
#define HLVDIE                        1318
#define LVDIE                         1319
#define BCL1IE                        1320
#define BCLIE                         1321
#define BCL2IE                        1322
#define SSP2IE                        1323
#define OSCFIE                        1324
#define PIR2                          1325
#define TMR3GIF                       1326
#define TMR3IF                        1327
#define HLVDIF                        1328
#define LVDIF                         1329
#define BCLIF                         1330
#define BCL1IF                        1331
#define BCL2IF                        1332
#define SSP2IF                        1333
#define OSCFIF                        1334
#define IPR2                          1335
#define TMR3GIP                       1336
#define TMR3IP                        1337
#define HLVDIP                        1338
#define LVDIP                         1339
#define BCLIP                         1340
#define BCL1IP                        1341
#define BCL2IP                        1342
#define SSP2IP                        1343
#define OSCFIP                        1344
#define PIE3                          1345
#define RXB0IE                        1346
#define RTCCIE                        1347
#define RXBNIE                        1348
#define CCP1IE                        1349
#define RXB1IE                        1350
#define CCP2IE                        1351
#define TXB0IE                        1352
#define CTMUIE                        1353
#define TXB1IE                        1354
#define TXBNIE                        1355
#define TXB2IE                        1356
#define TX2IE                         1357
#define RC2IE                         1358
#define TMR5GIE                       1359
#define PIR3                          1360
#define RTCCIF                        1361
#define RXBNIF                        1362
#define CCP1IF                        1363
#define CCP2IF                        1364
#define CTMUIF                        1365
#define TXBNIF                        1366
#define TX2IF                         1367
#define RC2IF                         1368
#define TMR5GIF                       1369
#define IPR3                          1370
#define RTCCIP                        1371
#define CCP1IP                        1372
#define RXBNIP                        1373
#define CCP2IP                        1374
#define CTMUIP                        1375
#define TX2IP                         1376
#define TXBNIP                        1377
#define RC2IP                         1378
#define TMR5GIP                       1379
#define PIR6                          1380
#define CMP1IF                        1381
#define CMP2IF                        1382
#define CMP3IF                        1383
#define EEIF                          1384
#define PSPCON                        1385
#define PSPMODE                       1386
#define IBOV                          1387
#define OBF                           1388
#define IBF                           1389
#define HLVDCON                       1390
#define HLVDL                         1391
#define HLVDL0                        1392
#define HLVDL1                        1393
#define HLVDL2                        1394
#define HLVDL3                        1395
#define HLVDEN                        1396
#define IRVST                         1397
#define BGVST                         1398
#define VDIRMAG                       1399
#define IPR6                          1400
#define CMP1IP                        1401
#define CMP2IP                        1402
#define CMP3IP                        1403
#define EEIP                          1404
#define T1GCON                        1405
#define T1GSS0                        1406
#define T1GSS                         1407
#define T1GSS1                        1408
#define T1GVAL                        1409
#define T1GGO_nT1DONE                 1410
#define nT1DONE                       1411
#define T1GGO_NOT_T1DONE              1412
#define NOT_T1DONE                    1413
#define T1GGO                         1414
#define T1GSPM                        1415
#define T1GTM                         1416
#define T1GPOL                        1417
#define TMR1GE                        1418
#define RCSTA1                        1419
#define RCSTA1_RX9D                   1420
#define RX9D1                         1421
#define RCD8                          1422
#define RCSTA1_OERR                   1423
#define OERR1                         1424
#define RCSTA1_FERR                   1425
#define FERR1                         1426
#define RCSTA1_ADDEN                  1427
#define ADDEN1                        1428
#define ADEN                          1429
#define RCSTA1_CREN                   1430
#define CREN1                         1431
#define SRENA                         1432
#define SREN1                         1433
#define RCSTA1_SREN                   1434
#define RC8_9                         1435
#define RCSTA1_RX9                    1436
#define nRC8                          1437
#define NOT_RC8                       1438
#define RC9                           1439
#define RX91                          1440
#define RCSTA1_SPEN                   1441
#define SPEN1                         1442
#define TXSTA1                        1443
#define TX9D1                         1444
#define TXSTA1_TX9D                   1445
#define TXD8                          1446
#define TRMT1                         1447
#define TXSTA1_TRMT                   1448
#define BRGH1                         1449
#define TXSTA1_BRGH                   1450
#define TXSTA1_SENDB                  1451
#define SENDB1                        1452
#define TXSTA1_SYNC                   1453
#define SYNC1                         1454
#define TXEN1                         1455
#define TXSTA1_TXEN                   1456
#define TX91                          1457
#define TX8_9                         1458
#define NOT_TX8                       1459
#define nTX8                          1460
#define TXSTA1_TX9                    1461
#define TXSTA1_CSRC                   1462
#define CSRC1                         1463
#define TXREG1                        1464
#define RCREG1                        1465
#define SPBRG1                        1466
#define T3GCON                        1467
#define T3GSS0                        1468
#define T3GSS                         1469
#define T3GSS1                        1470
#define T3GVAL                        1471
#define T3GGO                         1472
#define NOT_T3DONE                    1473
#define nT3DONE                       1474
#define T3GGO_nT3DONE                 1475
#define T3GGO_NOT_T3DONE              1476
#define T3GSPM                        1477
#define T3GTM                         1478
#define T3GPOL                        1479
#define TMR3GE                        1480
#define T3CON                         1481
#define TMR3ON                        1482
#define T3CON_RD16                    1483
#define nT3SYNC                       1484
#define NOT_T3SYNC                    1485
#define SOSCEN3                       1486
#define T3CON_SOSCEN                  1487
#define T3CKPS0                       1488
#define T3CKPS                        1489
#define T3CKPS1                       1490
#define TMR3CS0                       1491
#define TMR3CS                        1492
#define TMR3CS1                       1493
#define T3RD16                        1494
#define RD163                         1495
#define TMR3L                         1496
#define TMR3H                         1497
#define CMSTAT                        1498
#define CMSTAT_C1OUT                  1499
#define CMP1OUT                       1500
#define CMSTAT_C2OUT                  1501
#define CMP2OUT                       1502
#define CMP3OUT                       1503
#define CMSTAT_C3OUT                  1504
#define CVRCON                        1505
#define CVR                           1506
#define CVR0                          1507
#define CVR1                          1508
#define CVR2                          1509
#define CVR3                          1510
#define CVR4                          1511
#define CVRR                          1512
#define CVRSS                         1513
#define CVROEN                        1514
#define CVROE                         1515
#define CVREN                         1516
#define PIE4                          1517
#define CCP3IE                        1518
#define CCP4IE                        1519
#define CCP5IE                        1520
#define CCP6IE                        1521
#define CCP7IE                        1522
#define CCP8IE                        1523
#define PIR4                          1524
#define CCP3IF                        1525
#define CCP4IF                        1526
#define CCP5IF                        1527
#define CCP6IF                        1528
#define CCP7IF                        1529
#define CCP8IF                        1530
#define IPR4                          1531
#define CCP3IP                        1532
#define CCIP3IP                       1533
#define CCP4IP                        1534
#define CCP5IP                        1535
#define CCP6IP                        1536
#define CCP7IP                        1537
#define CCP8IP                        1538
#define PIE5                          1539
#define TMR4IE                        1540
#define TMR5IE                        1541
#define TMR6IE                        1542
#define TMR8IE                        1543
#define PIR5                          1544
#define TMR4IF                        1545
#define TMR5IF                        1546
#define TMR6IF                        1547
#define TMR8IF                        1548
#define CCP1CON                       1549
#define CCP1M0                        1550
#define CCP1M                         1551
#define CCP1M1                        1552
#define CCP1M2                        1553
#define CCP1M3                        1554
#define CCP1Y                         1555
#define DC1B                          1556
#define DC1B0                         1557
#define CCP1X                         1558
#define DC1B1                         1559
#define P1M                           1560
#define P1M0                          1561
#define P1M1                          1562
#define CCPR1L                        1563
#define CCPR1H                        1564
#define ECCP1DEL                      1565
#define P1DC                          1566
#define P1DC0                         1567
#define P1DC1                         1568
#define P1DC2                         1569
#define P1DC3                         1570
#define P1DC4                         1571
#define P1DC5                         1572
#define P1DC6                         1573
#define P1RSEN                        1574
#define PSS1BD0                       1575
#define PSS1BD                        1576
#define PSS1BD1                       1577
#define PSS1AC                        1578
#define PSS1AC0                       1579
#define PSS1AC1                       1580
#define ECCP1AS                       1581
#define ECCP1AS0                      1582
#define ECCP1AS1                      1583
#define ECCP1AS2                      1584
#define ECCP1ASE                      1585
#define ADCON2                        1586
#define ADCS0                         1587
#define ADCS                          1588
#define ADCS1                         1589
#define ADCS2                         1590
#define ACQT0                         1591
#define ACQT                          1592
#define ACQT1                         1593
#define ACQT2                         1594
#define ADFM                          1595
#define ADCON1                        1596
#define CHSN0                         1597
#define CHSN                          1598
#define CHSN1                         1599
#define CHSN2                         1600
#define VNCFG                         1601
#define CHSN3                         1602
#define VCFG                          1603
#define VCFG01                        1604
#define VCFG0                         1605
#define VCFG11                        1606
#define VCFG1                         1607
#define TRIGSEL                       1608
#define TRIGSEL0                      1609
#define TRIGSEL1                      1610
#define ADCON0                        1611
#define ADON                          1612
#define nDONE                         1613
#define GO_nDONE                      1614
#define NOT_DONE                      1615
#define GODONE                        1616
#define GO_DONE                       1617
#define DONE                          1618
#define GO_NOT_DONE                   1619
#define GO                            1620
#define CHS0                          1621
#define CHS                           1622
#define CHS1                          1623
#define CHS2                          1624
#define CHS3                          1625
#define CHS4                          1626
#define ADRESL                        1627
#define ADRESH                        1628
#define SSP1CON2                      1629
#define SEN1                          1630
#define SSP1CON2_SEN                  1631
#define ADMSK11                       1632
#define SSP1CON2_RSEN                 1633
#define RSEN1                         1634
#define SSP1CON2_ADMSK1               1635
#define SSP1CON2_PEN                  1636
#define ADMSK21                       1637
#define PEN1                          1638
#define SSP1CON2_ADMSK2               1639
#define ADMSK31                       1640
#define RCEN1                         1641
#define SSP1CON2_RCEN                 1642
#define SSP1CON2_ADMSK3               1643
#define SSP1CON2_ACKEN                1644
#define ACKEN1                        1645
#define ADMSK41                       1646
#define SSP1CON2_ADMSK4               1647
#define ACKDT1                        1648
