tiborsimon/embedded-tdd-headers/pic/pic18/pic18f85k22_tdd.h
#define ADMSK51                       1649
#define SSP1CON2_ACKDT                1650
#define SSP1CON2_ADMSK5               1651
#define SSP1CON2_ACKSTAT              1652
#define ACKSTAT1                      1653
#define GCEN1                         1654
#define SSP1CON2_GCEN                 1655
#define SSP1CON1                      1656
#define SSP1CON1_SSPM0                1657
#define SSPM01                        1658
#define SSP1CON1_SSPM                 1659
#define SSP1CON1_SSPM1                1660
#define SSPM11                        1661
#define SSP1CON1_SSPM2                1662
#define SSPM21                        1663
#define SSPM31                        1664
#define SSP1CON1_SSPM3                1665
#define SSP1CON1_CKP                  1666
#define CKP1                          1667
#define SSPEN1                        1668
#define SSP1CON1_SSPEN                1669
#define SSPOV1                        1670
#define SSP1CON1_SSPOV                1671
#define WCOL1                         1672
#define SSP1CON1_WCOL                 1673
#define SSP1STAT                      1674
#define BF1                           1675
#define SSP1STAT_BF                   1676
#define UA1                           1677
#define SSP1STAT_UA                   1678
#define SSP1STAT_R_NOT_W              1679
#define RW1                           1680
#define NOT_W                         1681
#define SSP1STAT_R                    1682
#define SSP1STAT_nW                   1683
#define RW                            1684
#define SSP1STAT_READ_WRITE           1685
#define SSP1STAT_nWRITE               1686
#define SSP1STAT_I2C_READ             1687
#define SSP1STAT_R_W                  1688
#define SSP1STAT_NOT_WRITE            1689
#define SSP1STAT_R_nW                 1690
#define SSP1STAT_S                    1691
#define START                         1692
#define SSP1STAT_I2C_START            1693
#define START1                        1694
#define STOP                          1695
#define SSP1STAT_P                    1696
#define STOP1                         1697
#define SSP1STAT_I2C_STOP             1698
#define SSP1STAT_D                    1699
#define SSP1STAT_D_NOT_A              1700
#define NOT_A                         1701
#define SSP1STAT_D_A                  1702
#define SSP1STAT_D_nA                 1703
#define SSP1STAT_NOT_ADDRESS          1704
#define SSP1STAT_nA                   1705
#define DA1                           1706
#define DA                            1707
#define SSP1STAT_I2C_DAT              1708
#define SSP1STAT_nADDRESS             1709
#define SSP1STAT_DATA_ADDRESS         1710
#define SSP1STAT_CKE                  1711
#define CKE1                          1712
#define SSP1STAT_SMP                  1713
#define SMP1                          1714
#define SSP1ADD_MSK0                  1715
#define MSK01                         1716
#define SSP1ADD                       1717
#define SSP1ADD_MSK1                  1718
#define MSK11                         1719
#define SSP1ADD_MSK2                  1720
#define MSK21                         1721
#define MSK31                         1722
#define SSP1ADD_MSK3                  1723
#define SSP1ADD_MSK4                  1724
#define MSK41                         1725
#define MSK51                         1726
#define SSP1ADD_MSK5                  1727
#define SSP1ADD_MSK6                  1728
#define MSK61                         1729
#define SSP1ADD_MSK7                  1730
#define MSK71                         1731
#define SSP1MSK                       1732
#define SSP1MSK_MSK0                  1733
#define SSP1MSK_MSK1                  1734
#define SSP1MSK_MSK2                  1735
#define SSP1MSK_MSK3                  1736
#define SSP1MSK_MSK4                  1737
#define SSP1MSK_MSK5                  1738
#define SSP1MSK_MSK6                  1739
#define SSP1MSK_MSK7                  1740
#define SSP1BUF                       1741
#define SSPBUF                        1742
#define T2CON                         1743
#define T2CKPS0                       1744
#define T2CKPS                        1745
#define T2CKPS1                       1746
#define TMR2ON                        1747
#define T2OUTPS0                      1748
#define T2OUTPS                       1749
#define T2OUTPS1                      1750
#define T2OUTPS2                      1751
#define T2OUTPS3                      1752
#define PR2                           1753
#define TMR2                          1754
#define T1CON                         1755
#define TMR1ON                        1756
#define T1CON_RD16                    1757
#define NOT_T1SYNC                    1758
#define nT1SYNC                       1759
#define T1OSCEN                       1760
#define T1CON_SOSCEN                  1761
#define T1CKPS0                       1762
#define T1CKPS                        1763
#define T1CKPS1                       1764
#define TMR1CS0                       1765
#define TMR1CS                        1766
#define T1RD16                        1767
#define TMR1CS1                       1768
#define TMR1L                         1769
#define TMR1H                         1770
#define RCON                          1771
#define BOR                           1772
#define NOT_BOR                       1773
#define nBOR                          1774
#define POR                           1775
#define nPOR                          1776
#define NOT_POR                       1777
#define PD                            1778
#define nPD                           1779
#define NOT_PD                        1780
#define nTO                           1781
#define TO                            1782
#define NOT_TO                        1783
#define nRI                           1784
#define NOT_RI                        1785
#define RI                            1786
#define NOT_CM                        1787
#define CM                            1788
#define nCM                           1789
#define SBOREN                        1790
#define IPEN                          1791
#define WDTCON                        1792
#define SWDTEN                        1793
#define SWDTE                         1794
#define ULPSINK                       1795
#define ULPEN                         1796
#define SRETEN                        1797
#define ULPLVL                        1798
#define REGSLP                        1799
#define IPR5                          1800
#define CCH05                         1801
#define TMR4IP                        1802
#define IPR5_CCH0                     1803
#define CCH15                         1804
#define TMR5IP                        1805
#define IPR5_CCH1                     1806
#define TMR6IP                        1807
#define EVPOL05                       1808
#define IPR5_EVPOL0                   1809
#define EVPOL15                       1810
#define IPR5_EVPOL1                   1811
#define TMR8IP                        1812
#define OSCCON                        1813
#define SCS0                          1814
#define SCS                           1815
#define SCS1                          1816
#define HFIOFS                        1817
#define OSTS                          1818
#define IRCF                          1819
#define IRCF0                         1820
#define IRCF1                         1821
#define IRCF2                         1822
#define IDLEN                         1823
#define SPBRGH1                       1824
#define T0CON                         1825
#define T0PS                          1826
#define T0PS0                         1827
#define T0PS1                         1828
#define T0PS2                         1829
#define PSA                           1830
#define T0SE                          1831
#define T0CS                          1832
#define T08BIT                        1833
#define TMR0ON                        1834
#define TMR0L                         1835
#define TMR0H                         1836
#define STATUS                        1837
#define C                             1838
#define CARRY                         1839
#define DC                            1840
#define ZERO                          1841
#define Z                             1842
#define OV                            1843
#define OVERFLOW                      1844
#define N                             1845
#define NEGATIVE                      1846
#define FSR2L                         1847
#define PLUSW2                        1848
#define PREINC2                       1849
#define POSTDEC2                      1850
#define POSTINC2                      1851
#define INDF2                         1852
#define FSR1L                         1853
#define PLUSW1                        1854
#define PREINC1                       1855
#define POSTDEC1                      1856
#define POSTINC1                      1857
#define INDF1                         1858
#define WREG                          1859
#define FSR0L                         1860
#define PLUSW0                        1861
#define PREINC0                       1862
#define POSTDEC0                      1863
#define POSTINC0                      1864
#define INDF0                         1865
#define INTCON3                       1866
#define INT1IF                        1867
#define INT1F                         1868
#define INT2IF                        1869
#define INT2F                         1870
#define INT3F                         1871
#define INT3IF                        1872
#define INT1E                         1873
#define INT1IE                        1874
#define INT2IE                        1875
#define INT2E                         1876
#define INT3E                         1877
#define INT3IE                        1878
#define INT1P                         1879
#define INT1IP                        1880
#define INT2IP                        1881
#define INT2P                         1882
#define INTCON2                       1883
#define RBIP                          1884
#define INT3IP                        1885
#define INT3P                         1886
#define TMR0IP                        1887
#define T0IP                          1888
#define INTEDG3                       1889
#define INTEDG2                       1890
#define INTEDG1                       1891
#define INTEDG0                       1892
#define RBPU                          1893
#define NOT_RBPU                      1894
#define nRBPU                         1895
#define INTCON                        1896
#define RBIF                          1897
#define INT0F                         1898
#define INT0IF                        1899
#define T0IF                          1900
#define TMR0IF                        1901
#define RBIE                          1902
#define INT0E                         1903
#define INT0IE                        1904
#define T0IE                          1905
#define TMR0IE                        1906
#define PEIE                          1907
#define PEIE_GIEL                     1908
#define GIEL                          1909
#define GIE_GIEH                      1910
#define GIE                           1911
#define GIEH                          1912
#define PRODL                         1913
#define PRODH                         1914
#define TABLAT                        1915
#define TBLPTRL                       1916
#define TBLPTRH                       1917
#define PCL                           1918
#define PCLATH                        1919
#define PCH                           1920
#define SP0                           1921
#define STKPTR                        1922
#define SP1                           1923
#define SP2                           1924
#define SP3                           1925
#define SP4                           1926
#define STKUNF                        1927
#define STKOVF                        1928
#define STKFUL                        1929
#define TOSL                          1930
#define TOSH                          1931

#endif // _PIC18F85K22_H_
